iscle/IronOSLite/include/stc8h3k64s2.h
#ifndef	_STC8xxxx_H
#define	_STC8xxxx_H

/*  BYTE Registers  */
__sfr __at (0x80) P0;
__sfr __at (0x81) SP;
__sfr __at (0x82) DPL;
__sfr __at (0x83) DPH;
__sfr __at (0x87) PCON;

__sfr __at (0x88) TCON;
__sfr __at (0x89) TMOD;
__sfr __at (0x8A) TL0;
__sfr __at (0x8B) TL1;
__sfr __at (0x8C) TH0;
__sfr __at (0x8D) TH1;
__sfr __at (0x8E) AUXR;
__sfr __at (0x8F) INT_CLKO;

__sfr __at (0x90) P1;
__sfr __at (0x91) P1M1;
__sfr __at (0x92) P1M0;
__sfr __at (0x93) P0M1;
__sfr __at (0x94) P0M0;
__sfr __at (0x95) P2M1;
__sfr __at (0x96) P2M0;

__sfr __at (0x98) SCON;
__sfr __at (0x99) SBUF;
__sfr __at (0x9A) S2CON;
__sfr __at (0x9B) S2BUF;
__sfr __at (0x9D) IRCBAND;
__sfr __at (0x9E) LIRTRIM;
__sfr __at (0x9F) IRTRIM;

__sfr __at (0xA0) P2;
__sfr __at (0xA1) BUS_SPEED;
__sfr __at (0xA2) P_SW1;

__sfr __at (0xA8) IE;
__sfr __at (0xA9) SADDR;
__sfr __at (0xAA) WKTCL;
__sfr __at (0xAB) WKTCH;
__sfr __at (0xAE) TA;
__sfr __at (0xAF) IE2;

__sfr __at (0xB0) P3;
__sfr __at (0xB1) P3M1;
__sfr __at (0xB2) P3M0;
__sfr __at (0xB3) P4M1;
__sfr __at (0xB4) P4M0;
__sfr __at (0xB5) IP2;
__sfr __at (0xB6) IP2H;
__sfr __at (0xB7) IPH;

__sfr __at (0xB8) IP;
__sfr __at (0xB9) SADEN;
__sfr __at (0xBA) P_SW2;
__sfr __at (0xBC) ADC_CONTR;
__sfr __at (0xBD) ADC_RES;
__sfr __at (0xBE) ADC_RESL;

__sfr __at (0xC0) P4;
__sfr __at (0xC1) WDT_CONTR;
__sfr __at (0xC2) IAP_DATA;
__sfr __at (0xC3) IAP_ADDRH;
__sfr __at (0xC4) IAP_ADDRL;
__sfr __at (0xC5) IAP_CMD;
__sfr __at (0xC6) IAP_TRIG;
__sfr __at (0xC7) IAP_CONTR;

__sfr __at (0xC2) ISP_DATA;
__sfr __at (0xC3) ISP_ADDRH;
__sfr __at (0xC4) ISP_ADDRL;
__sfr __at (0xC5) ISP_CMD;
__sfr __at (0xC6) ISP_TRIG;
__sfr __at (0xC7) ISP_CONTR;

__sfr __at (0xC8) P5;
__sfr __at (0xC9) P5M1;
__sfr __at (0xCA) P5M0;
__sfr __at (0xCB) P6M1;
__sfr __at (0xCC) P6M0;
__sfr __at (0xCD) SPSTAT;
__sfr __at (0xCE) SPCTL;
__sfr __at (0xCF) SPDAT;

__sfr __at (0xD0) PSW;
__sfr __at (0xD1) T4T3M;
__sfr __at (0xD2) T4H;
__sfr __at (0xD3) T4L;
__sfr __at (0xD4) T3H;
__sfr __at (0xD5) T3L;
__sfr __at (0xD6) T2H;
__sfr __at (0xD7) T2L;

__sfr __at (0xDE) ADCCFG;
__sfr __at (0xDF) IP3;

__sfr __at (0xE0) ACC;
__sfr __at (0xE1) P7M1;
__sfr __at (0xE2) P7M0;
__sfr __at (0xE3) DPS;
__sfr __at (0xE4) DPL1;
__sfr __at (0xE5) DPH1;
__sfr __at (0xE6) CMPCR1;
__sfr __at (0xE7) CMPCR2;

__sfr __at (0xE8) P6;
__sfr __at (0xEE) IP3H;
__sfr __at (0xEF) AUXINTIF;

__sfr __at (0xF0) B;
__sfr __at (0xF5) IAP_TPS;

__sfr __at (0xF8) P7;
__sfr __at (0xFF) RSTCFG;

//                                     7    6    5    4    3     2       1       0      Reset Value
//INT_CLKO:  中断与时钟输出控制寄存器  -   EX4  EX3  EX2   -   T2CLKO  T1CLKO  T0CLKO    0000,0000
#define	INT4_Enable()	INT_CLKO |= (1 << 6)
#define	INT3_Enable()	INT_CLKO |= (1 << 5)	
#define	INT2_Enable()	INT_CLKO |= (1 << 4)	
#define	INT1_Enable()	EX1 = 1
#define	INT0_Enable()	EX0 = 1

#define	INT4_Disable()	INT_CLKO &= ~(1 << 6)
#define	INT3_Disable()	INT_CLKO &= ~(1 << 5)	
#define	INT2_Disable()	INT_CLKO &= ~(1 << 4)	
#define	INT1_Disable()	EX1 = 0
#define	INT0_Disable()	EX0 = 0

//                               7    6       5       4      3    2     1     0      Reset Value
//AUXINTIF:  辅助中断标志寄存器  -  INT4IF  INT3IF  INT2IF   -   T4IF  T3IF  T2IF    0000,0000
#define	INT4IF	0x40
#define	INT3IF	0x20
#define	INT2IF	0x10
#define	T4IF	0x04
#define	T3IF	0x02
#define	T2IF	0x01

#define	INT4_Clear()	AUXINTIF &= ~INT4IF		/* 清除外中断4标志位 */
#define	INT3_Clear()	AUXINTIF &= ~INT3IF		/* 清除外中断3标志位 */
#define	INT2_Clear()	AUXINTIF &= ~INT2IF		/* 清除外中断2标志位 */
#define	INT1_Clear()	IE1 = 0					/* 清除外中断1标志位 */
#define	INT0_Clear()	IE0 = 0					/* 清除外中断0标志位 */

#define	INT0_Fall()		IT0 = 1		/* INT0 下降沿中断           */
#define	INT0_RiseFall()	IT0 = 0		/* INT0 下降沿上升沿均中断   */
#define	INT1_Fall()		IT1 = 1		/* INT1 下降沿中断           */
#define	INT1_RiseFall()	IT0 = 0		/* INT1 下降沿上升沿均中断   */


//===============================================================
#define	EAXSFR()		P_SW2 |=  0x80		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展SFR(XSFR) */
#define	EAXRAM()		P_SW2 &= ~0x80		/* MOVX A,@DPTR/MOVX @DPTR,A指令的操作对象为扩展RAM(XRAM) */

#define	I2C_USE_P14P15()	P_SW2 &= ~0x30						/* 将I2C切换到P1.4(SDA) P1.5(SCL)(上电默认).*/
#define	I2C_USE_P24P25()	P_SW2  = (P_SW2 & ~0x30) | 0x10		/* 将I2C切换到P2.4(SDA) P2.5(SCL).*/
#define	I2C_USE_P76P77()	P_SW2  = (P_SW2 & ~0x30) | 0x20		/* 将I2C切换到P7.6(SDA) P7.7(SCL).*/
#define	I2C_USE_P33P32()	P_SW2 |= 0x30						/* 将I2C切换到P3.3(SDA) P3.2(SCL).*/

#define CLKSEL      (*(__xdata unsigned char volatile *)0xfe00)
#define	CKSEL		(*(__xdata unsigned char volatile *)0xfe00)	/* 主时钟源选择    */
#define	CLKDIV		(*(__xdata unsigned char volatile *)0xfe01)	/* 主时钟分频      */
#define	IRC24MCR	(*(__xdata unsigned char volatile *)0xfe02)	/* IRC 24MHZ控制   */
#define	XOSCCR		(*(__xdata unsigned char volatile *)0xfe03)	/* XOSC控制        */
#define	IRC32KCR	(*(__xdata unsigned char volatile *)0xfe04)	/* IRC 32KHZ控制   */
#define MCLKOCR   (*(__xdata unsigned char volatile *)0xfe05)
#define IRCDB     (*(__xdata unsigned char volatile *)0xfe06)
#define X32KCR    (*(__xdata unsigned char volatile *)0xfe08)

#define	MainFosc_IRC24M()	CKSEL = (CKSEL & ~0x03)			/* 选择内部24MHZ时钟 */
#define	MainFosc_XTAL()		CKSEL = (CKSEL & ~0x03) | 0x01	/* 选择外部晶振或时钟 */
#define	MainFosc_IRC32K()	CKSEL =  CKSEL | 0x03			/* 选择内部32K时钟 */
#define	EXT_CLOCK()			XOSCCR = 0x80					/* 选择外部时钟 */
#define	EXT_CRYSTAL()		XOSCCR = 0xC0					/* 选择外部晶振 */


#define	P0PU		(*(__xdata unsigned char volatile *)0xfe10)	/* P0 4.1K Pull Up Enable  */
#define	P1PU		(*(__xdata unsigned char volatile *)0xfe11)	/* P1 4.1K Pull Up Enable  */
#define	P2PU		(*(__xdata unsigned char volatile *)0xfe12)	/* P2 4.1K Pull Up Enable  */
#define	P3PU		(*(__xdata unsigned char volatile *)0xfe13)	/* P3 4.1K Pull Up Enable  */
#define	P4PU		(*(__xdata unsigned char volatile *)0xfe14)	/* P4 4.1K Pull Up Enable  */
#define	P5PU		(*(__xdata unsigned char volatile *)0xfe15)	/* P5 4.1K Pull Up Enable  */
#define	P6PU		(*(__xdata unsigned char volatile *)0xfe16)	/* P6 4.1K Pull Up Enable  */
#define	P7PU		(*(__xdata unsigned char volatile *)0xfe17)	/* P7 4.1K Pull Up Enable  */

#define	P0NCS		(*(__xdata unsigned char volatile *)0xfe18)	/* P0 Non Schmit Trigger  0: 使能端口施密特触发功能(默认), 1: 禁止  */
#define	P1NCS		(*(__xdata unsigned char volatile *)0xfe19)	/* P1 Non Schmit Trigger  */
#define	P2NCS		(*(__xdata unsigned char volatile *)0xfe1a)	/* P2 Non Schmit Trigger  */
#define	P3NCS		(*(__xdata unsigned char volatile *)0xfe1b)	/* P3 Non Schmit Trigger  */
#define	P4NCS		(*(__xdata unsigned char volatile *)0xfe1c)	/* P4 Non Schmit Trigger  */
#define	P5NCS		(*(__xdata unsigned char volatile *)0xfe1d)	/* P5 Non Schmit Trigger  */
#define	P6NCS		(*(__xdata unsigned char volatile *)0xfe1e)	/* P6 Non Schmit Trigger  */
#define	P7NCS		(*(__xdata unsigned char volatile *)0xfe1f)	/* P7 Non Schmit Trigger  */

