iscle/IronOSLite/include/stc8h3k64s2.h
#define P0SR    (*(__xdata unsigned char volatile *)0xfe20) /* 端口电平转换速度  0: 快, 1: 慢(默认)  */
#define P1SR    (*(__xdata unsigned char volatile *)0xfe21)
#define P2SR    (*(__xdata unsigned char volatile *)0xfe22)
#define P3SR    (*(__xdata unsigned char volatile *)0xfe23)
#define P4SR    (*(__xdata unsigned char volatile *)0xfe24)
#define P5SR    (*(__xdata unsigned char volatile *)0xfe25)
#define P6SR    (*(__xdata unsigned char volatile *)0xfe26)
#define P7SR    (*(__xdata unsigned char volatile *)0xfe27)

#define P0DR    (*(__xdata unsigned char volatile *)0xfe28) /* 端口驱动电流控制  0: 增强驱动能力, 1: 一般驱动能力(默认)  */
#define P1DR    (*(__xdata unsigned char volatile *)0xfe29)
#define P2DR    (*(__xdata unsigned char volatile *)0xfe2a)
#define P3DR    (*(__xdata unsigned char volatile *)0xfe2b)
#define P4DR    (*(__xdata unsigned char volatile *)0xfe2c)
#define P5DR    (*(__xdata unsigned char volatile *)0xfe2d)
#define P6DR    (*(__xdata unsigned char volatile *)0xfe2e)
#define P7DR    (*(__xdata unsigned char volatile *)0xfe2f)

#define P0IE    (*(__xdata unsigned char volatile *)0xfe30)/* 端口数字信号输入使能  0: 禁止数字信号输入, 1: 使能数字信号输入(默认)  */
#define P1IE    (*(__xdata unsigned char volatile *)0xfe31)
#define P2IE    (*(__xdata unsigned char volatile *)0xfe32)
#define P3IE    (*(__xdata unsigned char volatile *)0xfe33)
#define P4IE    (*(__xdata unsigned char volatile *)0xfe34)
#define P5IE    (*(__xdata unsigned char volatile *)0xfe35)
#define P6IE    (*(__xdata unsigned char volatile *)0xfe36)
#define P7IE    (*(__xdata unsigned char volatile *)0xfe37)

#define	I2CCFG		(*(__xdata unsigned char volatile *)0xfe80)	/*   */
#define	I2CMSCR		(*(__xdata unsigned char volatile *)0xfe81)	/*   */
#define	I2CMSST		(*(__xdata unsigned char volatile *)0xfe82)	/*   */
#define	I2CSLCR		(*(__xdata unsigned char volatile *)0xfe83)	/*   */
#define	I2CSLST		(*(__xdata unsigned char volatile *)0xfe84)	/*   */
#define	I2CSLADR	(*(__xdata unsigned char volatile *)0xfe85)	/*   */
#define	I2CTXD		(*(__xdata unsigned char volatile *)0xfe86)	/*   */
#define	I2CRXD		(*(__xdata unsigned char volatile *)0xfe87)	/*   */
#define I2CMSAUX  (*(__xdata unsigned char volatile *)0xfe88)

#define TM2PS     (*(__xdata unsigned char volatile *)0xfea2)
#define TM3PS     (*(__xdata unsigned char volatile *)0xfea3)
#define TM4PS     (*(__xdata unsigned char volatile *)0xfea4)
#define ADCTIM    (*(__xdata unsigned char volatile *)0xfea8)
#define T3T4PIN   (*(__xdata unsigned char volatile *)0xfeac)

#define PWMA_ETRPS (*(__xdata unsigned char volatile *)0xfeb0)
#define PWMA_ENO   (*(__xdata unsigned char volatile *)0xfeb1)
#define PWMA_PS    (*(__xdata unsigned char volatile *)0xfeb2)
#define PWMA_IOAUX (*(__xdata unsigned char volatile *)0xfeb3)
#define PWMB_ETRPS (*(__xdata unsigned char volatile *)0xfeb4)
#define PWMB_ENO   (*(__xdata unsigned char volatile *)0xfeb5)
#define PWMB_PS    (*(__xdata unsigned char volatile *)0xfeb6)
#define PWMB_IOAUX (*(__xdata unsigned char volatile *)0xfeb7)
#define PWMA_CR1   (*(__xdata unsigned char volatile *)0xfec0)
#define PWMA_CR2   (*(__xdata unsigned char volatile *)0xfec1)
#define PWMA_SMCR  (*(__xdata unsigned char volatile *)0xfec2)
#define PWMA_ETR   (*(__xdata unsigned char volatile *)0xfec3)
#define PWMA_IER   (*(__xdata unsigned char volatile *)0xfec4)
#define PWMA_SR1   (*(__xdata unsigned char volatile *)0xfec5)
#define PWMA_SR2   (*(__xdata unsigned char volatile *)0xfec6)
#define PWMA_EGR   (*(__xdata unsigned char volatile *)0xfec7)
#define PWMA_CCMR1 (*(__xdata unsigned char volatile *)0xfec8)
#define PWMA_CCMR2 (*(__xdata unsigned char volatile *)0xfec9)
#define PWMA_CCMR3 (*(__xdata unsigned char volatile *)0xfeca)
#define PWMA_CCMR4 (*(__xdata unsigned char volatile *)0xfecb)
#define PWMA_CCER1 (*(__xdata unsigned char volatile *)0xfecc)
#define PWMA_CCER2 (*(__xdata unsigned char volatile *)0xfecd)
#define PWMA_CNTR  (*(__xdata unsigned int volatile *)0xfece)
#define PWMA_CNTRH (*(__xdata unsigned char volatile *)0xfece)
#define PWMA_CNTRL (*(__xdata unsigned char volatile *)0xfecf)
#define PWMA_PSCR  (*(__xdata unsigned int volatile *)0xfed0)
#define PWMA_PSCRH (*(__xdata unsigned char volatile *)0xfed0)
#define PWMA_PSCRL (*(__xdata unsigned char volatile *)0xfed1)
#define PWMA_ARR   (*(__xdata unsigned int volatile *)0xfed2)
#define PWMA_ARRH  (*(__xdata unsigned char volatile *)0xfed2)
#define PWMA_ARRL  (*(__xdata unsigned char volatile *)0xfed3)
#define PWMA_RCR   (*(__xdata unsigned char volatile *)0xfed4)
#define PWMA_CCR1  (*(__xdata unsigned int volatile *)0xfed5)
#define PWMA_CCR1H (*(__xdata unsigned char volatile *)0xfed5)
#define PWMA_CCR1L (*(__xdata unsigned char volatile *)0xfed6)
#define PWMA_CCR2  (*(__xdata unsigned int volatile *)0xfed7)
#define PWMA_CCR2H (*(__xdata unsigned char volatile *)0xfed7)
#define PWMA_CCR2L (*(__xdata unsigned char volatile *)0xfed8)
#define PWMA_CCR3  (*(__xdata unsigned int volatile *)0xfed9)
#define PWMA_CCR3H (*(__xdata unsigned char volatile *)0xfed9)
#define PWMA_CCR3L (*(__xdata unsigned char volatile *)0xfeda)
#define PWMA_CCR4  (*(__xdata unsigned int volatile *)0xfedb)
#define PWMA_CCR4H (*(__xdata unsigned char volatile *)0xfedb)
#define PWMA_CCR4L (*(__xdata unsigned char volatile *)0xfedc)
#define PWMA_BRK   (*(__xdata unsigned char volatile *)0xfedd)
#define PWMA_DTR   (*(__xdata unsigned char volatile *)0xfede)
#define PWMA_OISR  (*(__xdata unsigned char volatile *)0xfedf)

#define PWMB_CR1   (*(__xdata unsigned char volatile *)0xfee0)
#define PWMB_CR2   (*(__xdata unsigned char volatile *)0xfee1)
#define PWMB_SMCR  (*(__xdata unsigned char volatile *)0xfee2)
#define PWMB_ETR   (*(__xdata unsigned char volatile *)0xfee3)
#define PWMB_IER   (*(__xdata unsigned char volatile *)0xfee4)
#define PWMB_SR1   (*(__xdata unsigned char volatile *)0xfee5)
#define PWMB_SR2   (*(__xdata unsigned char volatile *)0xfee6)
#define PWMB_EGR   (*(__xdata unsigned char volatile *)0xfee7)
#define PWMB_CCMR1 (*(__xdata unsigned char volatile *)0xfee8)
#define PWMB_CCMR2 (*(__xdata unsigned char volatile *)0xfee9)
#define PWMB_CCMR3 (*(__xdata unsigned char volatile *)0xfeea)
#define PWMB_CCMR4 (*(__xdata unsigned char volatile *)0xfeeb)
#define PWMB_CCER1 (*(__xdata unsigned char volatile *)0xfeec)
#define PWMB_CCER2 (*(__xdata unsigned char volatile *)0xfeed)
#define PWMB_CNTR  (*(__xdata unsigned int volatile *)0xfeee)
#define PWMB_CNTRH (*(__xdata unsigned char volatile *)0xfeee)
#define PWMB_CNTRL (*(__xdata unsigned char volatile *)0xfeef)
#define PWMB_PSCR  (*(__xdata unsigned int volatile *)0xfef0)
#define PWMB_PSCRH (*(__xdata unsigned char volatile *)0xfef0)
#define PWMB_PSCRL (*(__xdata unsigned char volatile *)0xfef1)
#define PWMB_ARR   (*(__xdata unsigned int volatile *)0xfef2)
#define PWMB_ARRH  (*(__xdata unsigned char volatile *)0xfef2)
#define PWMB_ARRL  (*(__xdata unsigned char volatile *)0xfef3)
#define PWMB_RCR   (*(__xdata unsigned char volatile *)0xfef4)
#define PWMB_CCR5  (*(__xdata unsigned int volatile *)0xfef5)
#define PWMB_CCR5H (*(__xdata unsigned char volatile *)0xfef5)
#define PWMB_CCR5L (*(__xdata unsigned char volatile *)0xfef6)
#define PWMB_CCR6  (*(__xdata unsigned int volatile *)0xfef7)
#define PWMB_CCR6H (*(__xdata unsigned char volatile *)0xfef7)
#define PWMB_CCR6L (*(__xdata unsigned char volatile *)0xfef8)
#define PWMB_CCR7  (*(__xdata unsigned int volatile *)0xfef9)
#define PWMB_CCR7H (*(__xdata unsigned char volatile *)0xfef9)
#define PWMB_CCR7L (*(__xdata unsigned char volatile *)0xfefa)
#define PWMB_CCR8  (*(__xdata unsigned int volatile *)0xfefb)
#define PWMB_CCR8H (*(__xdata unsigned char volatile *)0xfefb)
#define PWMB_CCR8L (*(__xdata unsigned char volatile *)0xfefc)
#define PWMB_BRK   (*(__xdata unsigned char volatile *)0xfefd)
#define PWMB_DTR   (*(__xdata unsigned char volatile *)0xfefe)
#define PWMB_OISR  (*(__xdata unsigned char volatile *)0xfeff)

/////////////////////////////////////////////////
//FD00H-FDFFH
/////////////////////////////////////////////////

#define     PWM0C       (*(__xdata unsigned int volatile *)0xff00)
#define     PWM0CH      (*(__xdata unsigned char volatile *)0xff00)
#define     PWM0CL      (*(__xdata unsigned char volatile *)0xff01)
#define     PWM0CKS     (*(__xdata unsigned char volatile *)0xff02)
#define     PWM0TADC    (*(__xdata unsigned int volatile *)0xff03)
#define     PWM0TADCH   (*(__xdata unsigned char volatile *)0xff03)
#define     PWM0TADCL   (*(__xdata unsigned char volatile *)0xff04)
#define     PWM0IF      (*(__xdata unsigned char volatile *)0xff05)
#define     PWM0FDCR    (*(__xdata unsigned char volatile *)0xff06)
#define     PWM00T1     (*(__xdata unsigned int volatile *)0xff10)
#define     PWM00T1H    (*(__xdata unsigned char volatile *)0xff10)
#define     PWM00T1L    (*(__xdata unsigned char volatile *)0xff11)
#define     PWM00T2     (*(__xdata unsigned int volatile *)0xff12)
#define     PWM00T2H    (*(__xdata unsigned char volatile *)0xff12)
#define     PWM00T2L    (*(__xdata unsigned char volatile *)0xff13)
#define     PWM00CR     (*(__xdata unsigned char volatile *)0xff14)
#define     PWM00HLD    (*(__xdata unsigned char volatile *)0xff15)
#define     PWM01T1     (*(__xdata unsigned int volatile *)0xff18)
#define     PWM01T1H    (*(__xdata unsigned char volatile *)0xff18)
#define     PWM01T1L    (*(__xdata unsigned char volatile *)0xff19)
#define     PWM01T2    	(*(__xdata unsigned int volatile *)0xff1a)
#define     PWM01T2H    (*(__xdata unsigned char volatile *)0xff1a)
#define     PWM01T2L    (*(__xdata unsigned char volatile *)0xff1b)
#define     PWM01CR     (*(__xdata unsigned char volatile *)0xff1c)
#define     PWM01HLD    (*(__xdata unsigned char volatile *)0xff1d)
#define     PWM02T1     (*(__xdata unsigned int volatile *)0xff20)
#define     PWM02T1H    (*(__xdata unsigned char volatile *)0xff20)
#define     PWM02T1L    (*(__xdata unsigned char volatile *)0xff21)
#define     PWM02T2    	(*(__xdata unsigned int volatile *)0xff22)
#define     PWM02T2H    (*(__xdata unsigned char volatile *)0xff22)
#define     PWM02T2L    (*(__xdata unsigned char volatile *)0xff23)
#define     PWM02CR     (*(__xdata unsigned char volatile *)0xff24)
#define     PWM02HLD    (*(__xdata unsigned char volatile *)0xff25)
#define     PWM03T1    	(*(__xdata unsigned int volatile *)0xff28)
#define     PWM03T1H    (*(__xdata unsigned char volatile *)0xff28)
#define     PWM03T1L    (*(__xdata unsigned char volatile *)0xff29)
#define     PWM03T2    	(*(__xdata unsigned int volatile *)0xff2a)
#define     PWM03T2H    (*(__xdata unsigned char volatile *)0xff2a)
#define     PWM03T2L    (*(__xdata unsigned char volatile *)0xff2b)
#define     PWM03CR     (*(__xdata unsigned char volatile *)0xff2c)
#define     PWM03HLD    (*(__xdata unsigned char volatile *)0xff2d)
#define     PWM04T1    	(*(__xdata unsigned int volatile *)0xff30)
#define     PWM04T1H    (*(__xdata unsigned char volatile *)0xff30)
#define     PWM04T1L    (*(__xdata unsigned char volatile *)0xff31)
#define     PWM04T2    	(*(__xdata unsigned int volatile *)0xff32)
#define     PWM04T2H    (*(__xdata unsigned char volatile *)0xff32)
#define     PWM04T2L    (*(__xdata unsigned char volatile *)0xff33)
#define     PWM04CR     (*(__xdata unsigned char volatile *)0xff34)
#define     PWM04HLD    (*(__xdata unsigned char volatile *)0xff35)
#define     PWM05T1     (*(__xdata unsigned int volatile *)0xff38)
#define     PWM05T1H    (*(__xdata unsigned char volatile *)0xff38)
#define     PWM05T1L    (*(__xdata unsigned char volatile *)0xff39)
#define     PWM05T2     (*(__xdata unsigned int volatile *)0xff3a)
#define     PWM05T2H    (*(__xdata unsigned char volatile *)0xff3a)
#define     PWM05T2L    (*(__xdata unsigned char volatile *)0xff3b)
#define     PWM05CR     (*(__xdata unsigned char volatile *)0xff3c)
#define     PWM05HLD    (*(__xdata unsigned char volatile *)0xff3d)
#define     PWM06T1     (*(__xdata unsigned int volatile *)0xff40)
#define     PWM06T1H    (*(__xdata unsigned char volatile *)0xff40)
#define     PWM06T1L    (*(__xdata unsigned char volatile *)0xff41)
#define     PWM06T2     (*(__xdata unsigned int volatile *)0xff42)
#define     PWM06T2H    (*(__xdata unsigned char volatile *)0xff42)
#define     PWM06T2L    (*(__xdata unsigned char volatile *)0xff43)
#define     PWM06CR     (*(__xdata unsigned char volatile *)0xff44)
#define     PWM06HLD    (*(__xdata unsigned char volatile *)0xff45)
#define     PWM07T1     (*(__xdata unsigned int volatile *)0xff48)
#define     PWM07T1H    (*(__xdata unsigned char volatile *)0xff48)
#define     PWM07T1L    (*(__xdata unsigned char volatile *)0xff49)
#define     PWM07T2     (*(__xdata unsigned int volatile *)0xff4a)
#define     PWM07T2H    (*(__xdata unsigned char volatile *)0xff4a)
#define     PWM07T2L    (*(__xdata unsigned char volatile *)0xff4b)
#define     PWM07CR     (*(__xdata unsigned char volatile *)0xff4c)
#define     PWM07HLD    (*(__xdata unsigned char volatile *)0xff4d)
#define     PWM1C       (*(__xdata unsigned int volatile *)0xff50)
#define     PWM1CH      (*(__xdata unsigned char volatile *)0xff50)
#define     PWM1CL      (*(__xdata unsigned char volatile *)0xff51)
#define     PWM1CKS     (*(__xdata unsigned char volatile *)0xff52)
#define     PWM1IF      (*(__xdata unsigned char volatile *)0xff55)
#define     PWM1FDCR    (*(__xdata unsigned char volatile *)0xff56)
#define     PWM10T1     (*(__xdata unsigned int volatile *)0xff60)
#define     PWM10T1H    (*(__xdata unsigned char volatile *)0xff60)
#define     PWM10T1L    (*(__xdata unsigned char volatile *)0xff61)
#define     PWM10T2     (*(__xdata unsigned int volatile *)0xff62)
#define     PWM10T2H    (*(__xdata unsigned char volatile *)0xff62)
#define     PWM10T2L    (*(__xdata unsigned char volatile *)0xff63)
#define     PWM10CR     (*(__xdata unsigned char volatile *)0xff64)
#define     PWM10HLD    (*(__xdata unsigned char volatile *)0xff65)
#define     PWM11T1     (*(__xdata unsigned int volatile *)0xff68)
#define     PWM11T1H    (*(__xdata unsigned char volatile *)0xff68)
#define     PWM11T1L    (*(__xdata unsigned char volatile *)0xff69)
#define     PWM11T2     (*(__xdata unsigned int volatile *)0xff6a)
#define     PWM11T2H    (*(__xdata unsigned char volatile *)0xff6a)
#define     PWM11T2L    (*(__xdata unsigned char volatile *)0xff6b)
#define     PWM11CR     (*(__xdata unsigned char volatile *)0xff6c)
#define     PWM11HLD    (*(__xdata unsigned char volatile *)0xff6d)
#define     PWM12T1     (*(__xdata unsigned int volatile *)0xff70)
#define     PWM12T1H    (*(__xdata unsigned char volatile *)0xff70)
#define     PWM12T1L    (*(__xdata unsigned char volatile *)0xff71)
#define     PWM12T2     (*(__xdata unsigned int volatile *)0xff72)
#define     PWM12T2H    (*(__xdata unsigned char volatile *)0xff72)
#define     PWM12T2L    (*(__xdata unsigned char volatile *)0xff73)
#define     PWM12CR     (*(__xdata unsigned char volatile *)0xff74)
#define     PWM12HLD    (*(__xdata unsigned char volatile *)0xff75)
#define     PWM13T1     (*(__xdata unsigned int volatile *)0xff78)
#define     PWM13T1H    (*(__xdata unsigned char volatile *)0xff78)
#define     PWM13T1L    (*(__xdata unsigned char volatile *)0xff79)
#define     PWM13T2     (*(__xdata unsigned int volatile *)0xff7a)
#define     PWM13T2H    (*(__xdata unsigned char volatile *)0xff7a)
#define     PWM13T2L    (*(__xdata unsigned char volatile *)0xff7b)
#define     PWM13CR     (*(__xdata unsigned char volatile *)0xff7c)
#define     PWM13HLD    (*(__xdata unsigned char volatile *)0xff7d)
#define     PWM14T1     (*(__xdata unsigned int volatile *)0xff80)
#define     PWM14T1H    (*(__xdata unsigned char volatile *)0xff80)
#define     PWM14T1L    (*(__xdata unsigned char volatile *)0xff81)
#define     PWM14T2     (*(__xdata unsigned int volatile *)0xff82)
#define     PWM14T2H    (*(__xdata unsigned char volatile *)0xff82)
#define     PWM14T2L    (*(__xdata unsigned char volatile *)0xff83)
#define     PWM14CR     (*(__xdata unsigned char volatile *)0xff84)
#define     PWM14HLD    (*(__xdata unsigned char volatile *)0xff85)
#define     PWM15T1     (*(__xdata unsigned int volatile *)0xff88)
#define     PWM15T1H    (*(__xdata unsigned char volatile *)0xff88)
#define     PWM15T1L    (*(__xdata unsigned char volatile *)0xff89)
#define     PWM15T2     (*(__xdata unsigned int volatile *)0xff8a)
#define     PWM15T2H    (*(__xdata unsigned char volatile *)0xff8a)
#define     PWM15T2L    (*(__xdata unsigned char volatile *)0xff8b)
#define     PWM15CR     (*(__xdata unsigned char volatile *)0xff8c)
#define     PWM15HLD    (*(__xdata unsigned char volatile *)0xff8d)
#define     PWM16T1     (*(__xdata unsigned int volatile *)0xff90)
#define     PWM16T1H    (*(__xdata unsigned char volatile *)0xff90)
#define     PWM16T1L    (*(__xdata unsigned char volatile *)0xff91)
#define     PWM16T2     (*(__xdata unsigned int volatile *)0xff92)
#define     PWM16T2H    (*(__xdata unsigned char volatile *)0xff92)
#define     PWM16T2L    (*(__xdata unsigned char volatile *)0xff93)
#define     PWM16CR     (*(__xdata unsigned char volatile *)0xff94)
#define     PWM16HLD    (*(__xdata unsigned char volatile *)0xff95)
#define     PWM17T1     (*(__xdata unsigned int volatile *)0xff98)
#define     PWM17T1H    (*(__xdata unsigned char volatile *)0xff98)
#define     PWM17T1L    (*(__xdata unsigned char volatile *)0xff99)
#define     PWM17T2     (*(__xdata unsigned int volatile *)0xff9a)
#define     PWM17T2H    (*(__xdata unsigned char volatile *)0xff9a)
#define     PWM17T2L    (*(__xdata unsigned char volatile *)0xff9b)
#define     PWM17CR     (*(__xdata unsigned char volatile *)0xff9c)
#define     PWM17HLD    (*(__xdata unsigned char volatile *)0xff9d)
#define     PWM2C       (*(__xdata unsigned int volatile *)0xffa0)
#define     PWM2CH      (*(__xdata unsigned char volatile *)0xffa0)
#define     PWM2CL      (*(__xdata unsigned char volatile *)0xffa1)
#define     PWM2CKS     (*(__xdata unsigned char volatile *)0xffa2)
#define     PWM2TADC    (*(__xdata unsigned int volatile *)0xffa3)
#define     PWM2TADCH   (*(__xdata unsigned char volatile *)0xffa3)
#define     PWM2TADCL   (*(__xdata unsigned char volatile *)0xffa4)
#define     PWM2IF      (*(__xdata unsigned char volatile *)0xffa5)
#define     PWM2FDCR    (*(__xdata unsigned char volatile *)0xffa6)
#define     PWM20T1     (*(__xdata unsigned int volatile *)0xffb0)
#define     PWM20T1H    (*(__xdata unsigned char volatile *)0xffb0)
#define     PWM20T1L    (*(__xdata unsigned char volatile *)0xffb1)
#define     PWM20T2     (*(__xdata unsigned int volatile *)0xffb2)
#define     PWM20T2H    (*(__xdata unsigned char volatile *)0xffb2)
#define     PWM20T2L    (*(__xdata unsigned char volatile *)0xffb3)
#define     PWM20CR     (*(__xdata unsigned char volatile *)0xffb4)
#define     PWM20HLD    (*(__xdata unsigned char volatile *)0xffb5)
#define     PWM21T1     (*(__xdata unsigned int volatile *)0xffb8)
#define     PWM21T1H    (*(__xdata unsigned char volatile *)0xffb8)
#define     PWM21T1L    (*(__xdata unsigned char volatile *)0xffb9)
#define     PWM21T2     (*(__xdata unsigned int volatile *)0xffba)
#define     PWM21T2H    (*(__xdata unsigned char volatile *)0xffba)
#define     PWM21T2L    (*(__xdata unsigned char volatile *)0xffbb)
#define     PWM21CR     (*(__xdata unsigned char volatile *)0xffbc)
#define     PWM21HLD    (*(__xdata unsigned char volatile *)0xffbd)
#define     PWM22T1     (*(__xdata unsigned int volatile *)0xffc0)
#define     PWM22T1H    (*(__xdata unsigned char volatile *)0xffc0)
#define     PWM22T1L    (*(__xdata unsigned char volatile *)0xffc1)
#define     PWM22T2     (*(__xdata unsigned int volatile *)0xffc2)
#define     PWM22T2H    (*(__xdata unsigned char volatile *)0xffc2)
#define     PWM22T2L    (*(__xdata unsigned char volatile *)0xffc3)
#define     PWM22CR     (*(__xdata unsigned char volatile *)0xffc4)
#define     PWM22HLD    (*(__xdata unsigned char volatile *)0xffc5)
#define     PWM23T1     (*(__xdata unsigned int volatile *)0xffc8)
#define     PWM23T1H    (*(__xdata unsigned char volatile *)0xffc8)
#define     PWM23T1L    (*(__xdata unsigned char volatile *)0xffc9)
#define     PWM23T2     (*(__xdata unsigned int volatile *)0xffca)
#define     PWM23T2H    (*(__xdata unsigned char volatile *)0xffca)
#define     PWM23T2L    (*(__xdata unsigned char volatile *)0xffcb)
#define     PWM23CR     (*(__xdata unsigned char volatile *)0xffcc)
#define     PWM23HLD    (*(__xdata unsigned char volatile *)0xffcd)
#define     PWM24T1     (*(__xdata unsigned int volatile *)0xffd0)
#define     PWM24T1H    (*(__xdata unsigned char volatile *)0xffd0)
#define     PWM24T1L    (*(__xdata unsigned char volatile *)0xffd1)
#define     PWM24T2     (*(__xdata unsigned int volatile *)0xffd2)
#define     PWM24T2H    (*(__xdata unsigned char volatile *)0xffd2)
#define     PWM24T2L    (*(__xdata unsigned char volatile *)0xffd3)
#define     PWM24CR     (*(__xdata unsigned char volatile *)0xffd4)
#define     PWM24HLD    (*(__xdata unsigned char volatile *)0xffd5)
#define     PWM25T1     (*(__xdata unsigned int volatile *)0xffd8)
#define     PWM25T1H    (*(__xdata unsigned char volatile *)0xffd8)
#define     PWM25T1L    (*(__xdata unsigned char volatile *)0xffd9)
#define     PWM25T2     (*(__xdata unsigned int volatile *)0xffda)
#define     PWM25T2H    (*(__xdata unsigned char volatile *)0xffda)
#define     PWM25T2L    (*(__xdata unsigned char volatile *)0xffdb)
#define     PWM25CR     (*(__xdata unsigned char volatile *)0xffdc)
#define     PWM25HLD    (*(__xdata unsigned char volatile *)0xffdd)
#define     PWM26T1     (*(__xdata unsigned int volatile *)0xffe0)
#define     PWM26T1H    (*(__xdata unsigned char volatile *)0xffe0)
#define     PWM26T1L    (*(__xdata unsigned char volatile *)0xffe1)
#define     PWM26T2     (*(__xdata unsigned int volatile *)0xffe2)
#define     PWM26T2H    (*(__xdata unsigned char volatile *)0xffe2)
#define     PWM26T2L    (*(__xdata unsigned char volatile *)0xffe3)
#define     PWM26CR     (*(__xdata unsigned char volatile *)0xffe4)
#define     PWM26HLD    (*(__xdata unsigned char volatile *)0xffe5)
#define     PWM27T1     (*(__xdata unsigned int volatile *)0xffe8)
#define     PWM27T1H    (*(__xdata unsigned char volatile *)0xffe8)
#define     PWM27T1L    (*(__xdata unsigned char volatile *)0xffe9)
#define     PWM27T2     (*(__xdata unsigned int volatile *)0xffea)
#define     PWM27T2H    (*(__xdata unsigned char volatile *)0xffea)
#define     PWM27T2L    (*(__xdata unsigned char volatile *)0xffeb)
#define     PWM27CR     (*(__xdata unsigned char volatile *)0xffec)
#define     PWM27HLD    (*(__xdata unsigned char volatile *)0xffed)

/////////////////////////////////////////////////
//FC00H-FCFFH
/////////////////////////////////////////////////

